{"armor": [{"affix": "Blessed Shield damage is increased by 442% for the first enemy it hits. (Crusader Only) [400 - 500]%", "name": "Akkhan's Manacles"}, {"affix": "Each stunned enemy within 25 yards reduces your damage taken by 9%. [9 - 12]%", "name": "Ancient Parthan Defenders"}, {"affix": "Attacks release a Poison Nova that deals 380% weapon damage as Poison to enemies within 10 yards. [350 - 450]%", "name": "Andariel's Visage"}, {"affix": "Punish gains the effect of every rune. (Crusader Only)", "name": "Angel Hair Braid"}, {"affix": "While above 94% primary resource, all damage taken is reduced by 50%. [90 - 95]%", "name": "Aquila Cuirass"}, {"affix": "Your Mirror Images have a chance to multiply when killed by enemies. (Wizard Only)", "name": "Archmage's Vicalyke"}, {"affix": "Smite will now also be cast at a second nearby enemy. (Crusader Only)", "name": "Armor of the Kind Regent"}, {"affix": "Increases the potency of your shields by 85%. (Wizard Only) [75 - 100]%", "name": "Ashnagarr's Blood Bracer"}, {"affix": "Firebats deals 257% increased damage to enemies affected by Locust Swarm or Piranhas. (Witch Doctor Only) [250 - 300]%", "name": "Bakuli Jungle Wraps"}, {"affix": "When receiving fatal damage, you instead automatically cast Smoke Screen and are healed to 25% Life. This effect may occur once every 120 seconds. (Demon Hunter Only) 120", "name": "Beckon Sail"}, {"affix": "Summon a Fetish Sycophant when you hit with a Mana spender. (Witch Doctor Only)", "name": "Belt of Transcendence"}, {"affix": "Every 7 seconds, call down Bombardment on a random nearby enemy. (Crusader Only) [6 - 8]", "name": "Belt of the Trove"}, {"affix": "Each hit with Seven-Sided Strike grants 4.0% damage reduction for 7 seconds. (Monk Only) [4.0 - 5.0]%", "name": "Binding of the Lost"}, {"affix": "Enemies hit by your Cyclone Strike take 157% increased damage from your Mystic Ally for 5 seconds. (Monk Only) [150 - 200]%", "name": "Bindings of the Lesser Gods"}, {"affix": "Dodging or getting hit by a ranged attack automatically shoots a homing rocket back at the attacker for 667% weapon damage as Physical. (Demon Hunter Only) [600 - 800]%", "name": "Blackfeather"}, {"affix": "Justice spawns a Blessed Hammer when it hits an enemy. (Crusader Only)", "name": "Blessed of Haull"}, {"affix": "While in the Land of the Dead, Command Skeletons deals 110% additional damage and gains the effect of the Enforcer, Frenzy, Dark Mending and Freezing Grasp runes. (Necromancer Only) [100 - 125]%", "name": "Bloodsong Mail"}, {"affix": "Gain 10000 Life regeneration per Second for each second you stand still. This effect stacks up to 4 times.", "name": "Boots of Disregard"}, {"affix": "Heaven's Fury deals 342% increased damage to enemies that are Blinded, Immobilized, or Stunned. (Crusader Only) [300 - 400]%", "name": "Bracer of Fury"}, {"affix": "Seismic Slam deals 442% increased damage to the first 5 enemies it hits. (Barbarian Only) [400 - 500]%", "name": "Bracers of Destruction"}, {"affix": "Hammer of the Ancients attacks 50% faster and deals 445% increased damage. (Barbarian Only) [375 - 500]%", "name": "Bracers of the First Men"}, {"affix": "Whenever a gem drops, a gem of the type socketed into your helmet also drops. This effect does not apply to Legendary Gems.", "name": "Broken Crown"}, {"affix": "Attacking with Bone Spikes has a 25% chance to cast a Bone Nova at the target location. (Necromancer Only) [20 - 30]%", "name": "Bryner's Journey"}, {"affix": "Automatically drop Caltrops when you are hit. This effect may only occur once every 6 seconds. (Demon Hunter Only)", "name": "Cape of the Dark Night"}, {"affix": "The 5 Fetishes closest to you will shoot a powerful Poison Dart every time you do. (Witch Doctor Only)", "name": "Carnevil"}, {"affix": "Enemies take 667% increased damage from your Tempest Rush for 5 seconds after you hit them with a Blind, Freeze, or Stun. (Monk Only) [600 - 800]%", "name": "Cesar's Memento"}, {"affix": "After using Impale, Vault costs no resource for 2 seconds. (Demon Hunter Only)", "name": "Chain of Shadows"}, {"affix": "After earning a survival bonus, quickly heal to full Life.", "name": "Chaingmail"}, {"affix": "Using War Cry increases the movement speed for you and all allies affected by 35% for 10 seconds. [30 - 40]%", "name": "Chilanik's Chain"}, {"affix": "Reduces the resource cost of Fire skills by 27%. [23 - 30]%", "name": "Cindercoat"}, {"affix": "Enemy missiles sometimes pass through you harmlessly. (Demon Hunter Only)", "name": "Cloak of Deception"}, {"affix": "While channeling Firebats, you gain 30% damage reduction and 71,752 Life per Hit. (Witch Doctor Only) [60,000 - 80,000]", "name": "Coils of the First Spider"}, {"affix": "Chance on hit to create a chaos field that Blinds and Slows enemies inside for 3 seconds. [3 - 4]", "name": "Cord of the Sherma"}, {"affix": "Chance on hit to create a chaos field that Blinds and Slows enemies inside for 3 seconds. [2 - 4]", "name": "Cord of the Sherma"}, {"affix": "Corpse Lance damage is increased by 29% for 3 seconds when you consume a corpse. Max 20 stacks. (Necromancer Only) [25 - 30]%", "name": "Corpsewhisper Pauldrons"}, {"affix": "Rain of Vengeance also summons a crashing beast that deals 3049% weapon damage. (Demon Hunter Only) [3000 - 4000]%", "name": "Crashing Rain"}, {"affix": "Slow Time gains the effect of every rune. (Wizard Only)", "name": "Crown of the Primus"}, {"affix": "Picking up gold grants experience.", "name": "Custerian Wristguards"}, {"affix": "Automatically cast Diamond Skin when you fall below 35% Life. This effect may occur once every 19 seconds. (Wizard Only) [15 - 20]", "name": "Dark Mage's Shade"}, {"affix": "You gain an additional 45% damage reduction when there is an enemy afflicted by any of your curses. (Necromancer Only) [40 - 50]%", "name": "Dayntee's Binding"}, {"affix": "30% chance to explode in a fan of knives for 750-950% weapon damage when hit. [25 - 35]%", "name": "Death Watch Mantle"}, {"affix": "Gain an aura of death that deals 792% of your Life per Second as Physical damage to enemies within 16 yards. You no longer regenerate Life. [750 - 1000]%", "name": "Death's Bargain"}, {"affix": "19% chance on being hit by an Undead enemy to charm it for 2 seconds. [15 - 20]%", "name": "Deathseer's Cowl"}, {"affix": "Your Bone Spirit's damage is increased by 442% for every second it is active. (Necromancer Only) [400 - 500]%", "name": "Defiler Cuisses"}, {"affix": "Primary skills that generate resource deal 87% additional damage. [80 - 100]%", "name": "Depth Diggers"}, {"affix": "When your Shield Bash hits 3 or fewer enemies, its damage is increased by 342% and 25% of its Wrath Cost is refunded. (Crusader Only) [300 - 400]%", "name": "Drakon's Lesson"}, {"affix": "Ground Stomp causes an Avalanche. (Barbarian Only)", "name": "Dread Iron"}, {"affix": "Reduce the cooldown of Breath of Heaven by 48%. (Monk Only) [38 - 50]%", "name": "Eye of Peshkov"}, {"affix": "Army of the Dead deals an additional 207% damage and gains the effect of the Unconventional Warfare rune. (Necromancer Only) [200 - 250]%", "name": "Fate's Vow"}, {"affix": "You automatically start with 45 Archon stacks when entering Archon form. (Wizard Only) [40 - 50]", "name": "Fazula's Improbable Chain"}, {"affix": "Burn the ground you walk on, dealing 342% weapon damage each second. [300 - 400]%", "name": "Fire Walkers"}, {"affix": "Burn the ground you walk on, dealing 100% weapon damage each second.", "name": "Fire Walkers"}, {"affix": "Cold skills deal 19% increased damage and have a 50% chance to Freeze enemies. [15 - 20]%", "name": "Frostburn"}, {"affix": "Call of the Ancients gains the effect of the Ancients' Fury rune. (Barbarian Only)", "name": "Fury of the Ancients"}, {"affix": "When your Blessed Hammer hits 3 or fewer enemies, 85% of its Wrath Cost is refunded. (Crusader Only) [75 - 100]%", "name": "Gabriel's Vambraces"}, {"affix": "Seismic Slam increases Earthquake damage by 207% for 3 seconds. (Barbarian Only) [200 - 250]%", "name": "Girdle of Giants"}, {"affix": "After earning a massacre bonus, gold rains from sky.", "name": "Gladiator Gauntlets"}, {"affix": "Shrine effects last for 10 minutes.", "name": "Gloves of Worship"}, {"affix": "Chance for enemies to drop gold when you hit them.", "name": "Goldskin"}, {"affix": "On gold pickup: Gain armor for 5 seconds equal to the amount picked up.", "name": "Goldwrap"}, {"affix": "The cooldown on Command Golem is reduced by 24 seconds and you take 30% less damage while your golem is alive. (Necromancer Only) [20 - 25]", "name": "Golemskin Breeches"}, {"affix": "When an exploded corpse damages at least one enemy, your Corpse Explosion deals 85% increased damage for 6 seconds, stacking up to 5 times. (Necromancer Only) [75 - 100]%", "name": "Grasps of Essence"}, {"affix": "Exploding Palm's on-death explosion applies Exploding Palm. (Monk Only)", "name": "Gungdo Gear"}, {"affix": "Lashing Tail Kick releases a piercing fireball that deals 1138% weapon damage as Fire to enemies within 10 yards on impact. (Monk Only) [1050 - 1400]%", "name": "Gyana Na Kashu"}, {"affix": "Enemies take 342% increased damage from your Blessed Hammers for 10 seconds after you hit them with a Blind, Immobilize, or Stun. (Crusader Only) [300 - 400]%", "name": "Hammer Jammers"}, {"affix": "Opening a chest grants 116% increased damage for 10 seconds. [100 - 135]%", "name": "Harrington Waistguard"}, {"affix": "Haunt releases 1 extra spirit. (Witch Doctor Only) 1", "name": "Haunting Girdle"}, {"affix": "Gain Thorns equal to 257% of your Vitality.", "name": "Heart of Iron"}, {"affix": "Grenades have a chance to bounce 4 times dealing an additional 50% damage on each bounce. This bonus is increased to 800% on the final bounce. (Demon Hunter Only) [3 - 5]", "name": "Hellcat Waistguard"}, {"affix": "Reduces the Arcane Power cost of Arcane Torrent, Disintegrate, and Ray of Frost by 54%. (Wizard Only) [50 - 65]%", "name": "Hergbrash's Binding"}, {"affix": "Your resource generation and damage is increased by 25% while moving and decreased by 24% while standing still. [20 - 25]%", "name": "Hexing Pants of Mr. Yan"}, {"affix": "Your Town Portal is no longer interrupted by taking damage. While casting Town Portal you gain a protective bubble that reduces damage taken by 54%. [50 - 65]%", "name": "Homing Pads"}, {"affix": "Your primary skills attack 30% faster and deal 49% increased damage. (Demon Hunter Only) [45 - 60]%", "name": "Hunter's Wrath"}, {"affix": "Locust Swarm also Slows enemies by 60%. (Witch Doctor Only) [60 - 80]%", "name": "Hwoj Wrap"}, {"affix": "Gain immunity to Freeze and Immobilize effects.", "name": "Ice Climbers"}, {"affix": "You may move unhindered through enemies.", "name": "Illusory Boots"}, {"affix": "Picking up a Health Globe increases your maximum Life by 5% for 15 seconds, stacking up to 5 times.", "name": "Insatiable Belt"}, {"affix": "Gain up to 29% increased movement speed based on amount of Life missing. [25 - 30]%", "name": "Irontoe Mudsputters"}, {"affix": "Enemies damaged by Black Hole are also slowed by 60% for 3 seconds. (Wizard Only) [60 - 80]%", "name": "Jang's Envelopment"}, {"affix": "Wall of Death deals 85% increased damage and can be cast up to three times within 2 seconds before the cooldown begins. (Witch Doctor Only) [75 - 100]%", "name": "Jeram's Bracers"}, {"affix": "Damaging enemies has a chance to grant you an effect that removes the Spirit cost of your abilities for 3 seconds. (Monk Only) [2 - 4]", "name": "Kekegi's Unbreakable Spirit"}, {"affix": "Fist of the Heavens costs 40% less Wrath and deals 163% more damage. (Crusader Only) [130 - 170]%", "name": "Khassett's Cord of Righteousness"}, {"affix": "Sweeping Wind gains 2 stacks every second it does not deal damage to any enemies. (Monk Only) 2", "name": "Kyoshiro's Soul"}, {"affix": "Reduce all damage taken by 6% for each stack of Soul Harvest you have. (Witch Doctor Only) 6%", "name": "Lakumba's Ornament"}, {"affix": "Rend can now stack up to 2 times on an enemy. (Barbarian Only)", "name": "Lamentation"}, {"affix": "Cyclone Strike reduces your damage taken by 45% for 5 seconds. (Monk Only) [40 - 50]%", "name": "Lefebvre's Soliloquy"}, {"affix": "Leap can be cast up to three times within 2 seconds before the cooldown begins. (Barbarian Only)", "name": "Lut Socks"}, {"affix": "Your Seven-Sided Strike applies Exploding Palm.", "name": "Madstone"}, {"affix": "Fire skills deal 19% increased damage. [15 - 20]%", "name": "Magefist"}, {"affix": "While channeling Whirlwind, Rapid Fire, Strafe, Tempest Rush, Firebats, Arcane Torrent, Disintegrate, or Ray of Frost, you deal 24% increased damage and take 25% reduced damage. [20 - 25]%", "name": "Mantle of Channeling"}, {"affix": "Pets deal 157% increased damage. (Witch Doctor Only) [150 - 200]%", "name": "Mask of Jeram"}, {"affix": "Revive now consumes all corpses to raise a minion that deals 135% more damage per corpse. (Necromancer Only) [125 - 150]%", "name": "Mask of Scarlet Death"}, {"affix": "Your Golem sheds a corpse every second. (Necromancer Only)", "name": "Moribund Gauntlets"}, {"affix": "Shrines and Pylons will spawn an enemy champion.", "name": "Nemesis Bracers"}, {"affix": "Increase the damage of Meteor by 600%. When your Meteor hits 3 or fewer enemies, the damage is increased by 675%. (Wizard Only) [675 - 900]%", "name": "Nilfur's Boast"}, {"affix": "Slash attacks in all directions. (Crusader Only)", "name": "Omnislash"}, {"affix": "Drop Caltrops when using Vault. (Demon Hunter Only)", "name": "Omryn's Chain"}, {"affix": "When receiving fatal damage, there is a chance that you are instead restored to 25% of maximum Life and cause nearby enemies to flee in fear.", "name": "Pauldrons of the Skeleton King"}, {"affix": "Wave of Light also Slows enemies by 80% for 3 seconds and deals 135% increased damage. (Monk Only) [125 - 150]%", "name": "Pinto's Pride"}, {"affix": "When 3 or more enemies are within 12 yards, you release a vile stench that deals 492% weapon damage as Poison every second for 5 seconds to enemies within 15 yards. [450 - 550]%", "name": "Pox Faulds"}, {"affix": "Increases the duration of Ignore Pain by 5 seconds. (Barbarian Only) [4 - 6]", "name": "Pride of Cassius"}, {"affix": "Your resource costs are reduced by 30% after not taking damage for 5 seconds.", "name": "Pride's Fall"}, {"affix": "5% chance to spawn a Nephalem Glory globe when you Blind an enemy. [4 - 6]%", "name": "Promise of Glory"}, {"affix": "Locust Swarm and Haunt now deal their damage in half of the normal duration.", "name": "Quetzalcoatl"}, {"affix": "The damage of Energy Twister is increased by 249% and it periodically pulls in lesser enemies within 30 yards. (Wizard Only) [225 - 300]%", "name": "Ranslor's Folly"}, {"affix": "Skeletal Mage gains the effect of the Gift of Death rune. (Necromancer Only)", "name": "Razeth's Volition"}, {"affix": "Picking up a Health Globe releases an explosion that deals 342% weapon damage as Fire to enemies within 20 yards. [300 - 400]%", "name": "Razor Strop"}, {"affix": "Health globes restore [25 - 30]% of your primary resource.", "name": "Reaper's Wraps"}, {"affix": "Devour restores an additional 85% Essence and Life. In addition, when Devour restores Essence or Life above your maximum, the excess is granted over 3 seconds. (Necromancer Only) [75 - 100]%", "name": "Requiem Cereplate"}, {"affix": "Lashing Tail Kick attacks 50% faster and deals 257% increased damage. (Monk Only) [250 - 300]%", "name": "Rivera Dancers"}, {"affix": "Judgment gains the effect of the Debilitate rune and is cast at your landing location when casting Falling Sword. (Crusader Only)", "name": "Sacred Harness"}, {"affix": "The damage of your next Overpower is increased by 45% for each enemy hit. Max 20 enemies. (Barbarian Only) [40 - 50]%", "name": "Saffron Wrap"}, {"affix": "Chance on being hit to deal 1000% of your Thorns damage to nearby enemies.", "name": "Sanguinary Vambraces"}, {"affix": "With every attack, you throw a dagger at a nearby enemy for 622% weapon damage as Physical. [500 - 650]%", "name": "Sash of Knives"}, {"affix": "Haunt is cast on all nearby enemies when you open a chest.", "name": "Sebor's Nightmare"}, {"affix": "Haunt is cast on 5 nearby enemies when you open a chest.", "name": "Sebor's Nightmare"}, {"affix": "While below 24% Life, all attacks are guaranteed Critical Hits. [20 - 25]%", "name": "Shi Mizu's Haori"}, {"affix": "Increase the damage of Ancient Spear - Boulder Toss by 100%. When your Boulder Toss hits 5 or fewer enemies, the damage is increased by 145%. (Barbarian Only) [120 - 150]%", "name": "Skular's Salvation"}, {"affix": "Threatening Shout has a chance to Charm enemies and cause them to join your side. (Barbarian Only)", "name": "Skull of Resonance"}, {"affix": "Your items become indestructible.", "name": "Spaulders of Zakara"}, {"affix": "Your Spirit Generators reduce your damage taken by 49% for 3 seconds. (Monk Only) [45 - 60]%", "name": "Spirit Guards"}, {"affix": "The first time an elite pack damages you, gain an absorb shield equal to 145% of your maximum Life for 10 seconds. [120 - 150]%", "name": "St. Archew's Gage"}, {"affix": "You gain 45% increased movement speed for 10 seconds after using Blood Rush. (Necromancer Only) [40 - 50]%", "name": "Steuart's Greaves"}, {"affix": "You gain 85% increased movement speed for 10 seconds after using Blood Rush. (Necromancer Only) [75 - 100]%", "name": "Steuart's Greaves"}, {"affix": "27% chance to cast a fiery ball when attacking. [20 - 40]%", "name": "Storm Crow"}, {"affix": "Reduces damage from melee attacks by 29%. [25 - 30]%", "name": "String of Ears"}, {"affix": "Enemies hit by knockbacks suffer 25% increased damage for 6 seconds. [20 - 30]%", "name": "Strongarm Bracers"}, {"affix": "Sacrifice deals 342% additional damage against enemies affected by Locust Swarm or Grasp of the Dead. (Witch Doctor Only) [300 - 400]%", "name": "Swamp Land Waders"}, {"affix": "Increase attack speed of your pets by 45%. [40 - 50]%", "name": "Tasker and Theo"}, {"affix": "Companion - Wolf Companion now summons 3 wolves.", "name": "The Cloak of the Garwulf"}, {"affix": "Mystic Ally summons two Mystic Allies that fight by your side. (Monk Only)", "name": "The Crudest Boots"}, {"affix": "Chance when attacking to summon horrific Mimics that cast some of your equipped skills.", "name": "The Grin Reaper"}, {"affix": "Using Blinding Flash restores 158 Spirit. (Monk Only) [125 - 165]", "name": "The Laws of Seph"}, {"affix": "Frost Hydra now periodically casts Frost Nova. (Wizard Only)", "name": "The Magistrate"}, {"affix": "Inner Sanctuary increases Spirit Regeneration per second by 14. (Monk Only) [10 - 15]", "name": "The Mind's Eye"}, {"affix": "Your Signature Spells attack 50% faster and restore 9 Arcane Power. (Wizard Only) [9 - 12]", "name": "The Shame of Delsere"}, {"affix": "The bonuses from Archon stacks now last for 19 seconds after Archon expires. (Wizard Only) [15 - 20]", "name": "The Swami"}, {"affix": "Frenzy gains the effect of every rune. (Barbarian Only)", "name": "The Undisputed Champion"}, {"affix": "Blocking, dodging or being hit causes you to discharge bolts of electricity that deal 129% weapon damage as Lightning. [100 - 130]%", "name": "Thundergod's Vigor"}, {"affix": "Horrify causes you to Fear and Root enemies around you for 7 seconds. (Witch Doctor Only) [6 - 8]", "name": "Tiklandian Visage"}, {"affix": "Spike Traps gain the Impaling Spines rune and are deployed twice as fast. (Demon Hunter Only)", "name": "Trag'Oul Coils"}, {"affix": "Wave of Light is now cast at your enemy. (Monk Only)", "name": "Tzo Krin's Gaze"}, {"affix": "Your primary skills heal you for 5.5% of your missing Life. (Barbarian Only) [5.0 - 6.0]%", "name": "Vambraces of Sescheron"}, {"affix": "Double the number of enemies your Electrocute jumps to.  (Wizard Only)", "name": "Velvet Camaral"}, {"affix": "Furious Charge deals 34% increased damage for every enemy hit while charging. (Barbarian Only) [30 - 35]%", "name": "Vile Ward"}, {"affix": "Summon a Fetish Army after you kill 2 Elites. (Witch Doctor Only)", "name": "Visage of Giyua"}, {"affix": "Vengeance gains the effect of the Dark Heart rune. (Demon Hunter Only)", "name": "Visage of Gunes"}, {"affix": "Reduce the cooldown and increase the damage of Phalanx by 49%. (Crusader Only) [45 - 60]%", "name": "Warhelm of Kassar"}, {"affix": "Every time you destroy a wreckable object, you gain a short burst of speed.", "name": "Warzechian Armguards"}, {"affix": "Your Hatred Generators reduce your damage taken by 45% for 5 seconds. (Demon Hunter Only) [40 - 50]%", "name": "Wraps of Clarity"}, {"affix": "You take 8.5% less damage for every Companion you have active. (Demon Hunter Only) [8.0 - 9.0]%", "name": "Zoey's Secret"}], "jewelry": [{"affix": "When receiving fatal damage, you are instead restored to 100% of maximum Life and resources. This item is destroyed in the process.", "name": "Ancestors' Grace"}, {"affix": "Lightning pulses periodically between all wearers of this item, dealing 1350% weapon damage. [1000 - 1500]%", "name": "Arcstone"}, {"affix": "Each time you pick up gold, increase your Gold and Health Pickup radius by 1 yard for 10 seconds, stacking up to 30 times.", "name": "Avarice Band"}, {"affix": "This ring occasionally haunts nearby enemies.", "name": "Band of Hollow Whispers"}, {"affix": "After casting Furious Charge, Ground Stomp, or Leap, take 74% reduced damage for 8 seconds. (Barbarian Only) [60 - 80]%", "name": "Band of Might"}, {"affix": "Your Spirit Generators generate 40% more Spirit. (Monk Only) [40 - 50]%", "name": "Band of the Rue Chambers"}, {"affix": "Uncursed enemies are pulled to the target location when a curse is applied to them. (Necromancer Only)", "name": "Briggs' Wrath"}, {"affix": "After 5 consecutive non-critical hits, your chance to critically hit is increased to 100% for 3 seconds. 3", "name": "Broken Promises"}, {"affix": "You drain life from enemies around you.", "name": "Bul-Kathos's Wedding Band"}, {"affix": "You now raise an additional Skeletal Mage with each cast and they last an additional 4 seconds. (Necromancer Only) [2 - 4]", "name": "Circle of Nailuj's Evol"}, {"affix": "Gain 179% increased damage to a single element for 4 seconds. This effect rotates through the elements available to your class in the following order: Arcane, Cold, Fire, Holy, Lightning, Physical, Poison. [150 - 200]%", "name": "Convention of Elements"}, {"affix": "Prevent all Arcane damage taken and heal yourself for 22% of the amount prevented. [20 - 25]%", "name": "Countess Julia's Cameo"}, {"affix": "Increases duration of Stun effects by 22%. [20 - 25]%", "name": "Dovu Energy Trap"}, {"affix": "After casting Shadow Power, Smoke Screen, or Vault, take 50% reduced damage for 8 seconds. (Demon Hunter Only) [50 - 60]%", "name": "Elusive Ring"}, {"affix": "Increases the duration of Phalanx avatars by 200%. (Crusader Only)", "name": "Eternal Union"}, {"affix": "After earning a massacre bonus, 6 Skeletons are summoned to fight by your side for 10 seconds. [4 - 6]", "name": "Golden Gorget of Leoric"}, {"affix": "When you use Akarat's Champion, you mesmerize nearby enemies with your skill, causing them to jump uncontrollably for [6 - 8] seconds.", "name": "Halcyon's Ascent"}, {"affix": "Your Ice Armor now reduces damage from melee attacks by 50% and automatically casts Frost Nova whenever you take 10% of your Life in damage. (Wizard Only) [50 - 60]%", "name": "Halo of Arlyse"}, {"affix": "You take 74% less damage for 5 seconds after your Storm Armor electrocutes an enemy more than 15 yards away. (Wizard Only) [60 - 80]%", "name": "Halo of Karini"}, {"affix": "Summons shadow clones to your aid when you Stun an enemy. This effect may occur once every 30 seconds. 30", "name": "Haunt of Vaxo"}, {"affix": "Simulacrum now drains 5% of your maximum life every second and lasts twice as long. (Necromancer Only) 5%", "name": "Haunted Visions"}, {"affix": "Gain damage reduction equal to 47% of your Block Chance. [45 - 55]%", "name": "Justice Lantern"}, {"affix": "Taking Fire damage restores your primary resource.", "name": "Krede's Flame"}, {"affix": "You deal 95% increased damage against slowed enemies or triple this bonus against enemies afflicted by any other type of control-impairing effect. (Necromancer Only) [75 - 100]%", "name": "Krysbin's Sentence"}, {"affix": "Picking up gold heals you for an amount equal to the gold that was picked up.", "name": "Kymbo's Gold"}, {"affix": "Your damage reduction is increased by 0.89% for every 1% Life you are missing. (Necromancer Only) [0.75 - 0.95]%", "name": "Lornelle's Sunstone"}, {"affix": "Enemies stunned with Paralysis also take 13,462% weapon damage as Lightning. (Wizard Only) [13,000 - 14,000]%", "name": "Manald Heal"}, {"affix": "Prevent all Poison damage taken and heal yourself for 12% of the amount prevented. [10 - 15]%", "name": "Mara's Kaleidoscope"}, {"affix": "Hitting an enemy within 15 yards has a chance to ward you with shards of Arcane energy that explode when enemies get close, dealing 320% weapon damage as Arcane to enemies within 15 yards. [240 - 320]%", "name": "Moonlight Ward"}, {"affix": "Summons a Fallen Lunatic to your side every 10 seconds. [10 - 12]", "name": "Nagelring"}, {"affix": "Reduce the remaining cooldown of one of your skills by 1 second when you hit with a resource-spending attack. 1", "name": "Obsidian Ring of the Zodiac"}, {"affix": "Chance to create an area of focused power on killing a monster. Damage is increased by 82% while standing in the area. [70 - 85]%", "name": "Oculus Ring"}, {"affix": "Chance on hit to charm the enemy. While charmed, the enemy takes 35% increased damage.", "name": "Overwhelming Desire"}, {"affix": "Enemies slain while Feared die in a bloody explosion and cause other nearby enemies to flee in Fear.", "name": "Pandemonium Loop"}, {"affix": "Enemies slain while Feared die in a bloody explosion for 800% weapon damage and cause other nearby enemies to flee in Fear.", "name": "Pandemonium Loop"}, {"affix": "Summon a treasure goblin who picks up normal-quality items for you. After picking up 16 items, he drops a rare item with a chance for a legendary. [12 - 16]", "name": "Puzzle Ring"}, {"affix": "Enemies you kill have a 3% additional chance to drop a health globe. [3 - 4]%", "name": "Rakoff's Glass of Life"}, {"affix": "Gain 57% increased movement speed for 4 seconds after Fearing an enemy. [45 - 60]%", "name": "Rechel's Ring of Larceny"}, {"affix": "You deal 279% increased damage to enemies affected by both your Haunt and Locust Swarm. (Witch Doctor Only) [250 - 300]%", "name": "Ring of Emptiness"}, {"affix": "Reduces the number of items needed for set bonuses by 1 (to a minimum of 2).", "name": "Ring of Royal Grandeur"}, {"affix": "Increase your Life per Second by up to 95% based on your missing Life. [75 - 100]%", "name": "Rogar's Huge Stone"}, {"affix": "Increase the damage of Whirlwind by 328% (Barbarian Only) [300 - 400]%", "name": "Skull Grasp"}, {"affix": "Prevent all Cold damage taken and heal yourself for 12% of the amount prevented. [10 - 15]%", "name": "Talisman of Aranoch"}, {"affix": "Chance on hit to pull in enemies toward your target and Slow them by 60%. [60 - 80]%", "name": "The Ess of Johan"}, {"affix": "When Land of the Dead expires, you are granted 50 stacks of Macabre Knowledge. Macabre Knowledge increases the damage of Corpse Lance and Corpse Explosion by 179%. (Necromancer Only) [150 - 200]%", "name": "The Johnstone"}, {"affix": "Gargantuan instead summons three smaller gargantuans that have their damage increased by 596%. (Witch Doctor Only) [500 - 650]%", "name": "The Short Man's Finger"}, {"affix": "Prevent all Fire damage taken and heal yourself for 12% of the amount prevented. [10 - 15]%", "name": "The Star of Azkaranth"}, {"affix": "Zombie Dogs instead summons a single gargantuan dog with more damage and health than all other dogs combined. (Witch Doctor Only)", "name": "The Tall Man's Finger"}, {"affix": "All damage taken is split between wearers of this item.", "name": "Unity"}, {"affix": "Increases the maximum stacks of Bone Armor by 5. (Necromancer Only) 5", "name": "Wisdom of Kalan"}, {"affix": "Lightning damage has a 25% chance to Stun for 1.5 seconds. [25 - 35]%", "name": "Wyrdward"}, {"affix": "Prevent all Lightning damage taken and heal yourself for 12% of the amount prevented. [10 - 15]%", "name": "Xephirian Amulet"}], "weapons": [{"affix": "Teleport no longer has a cooldown but costs 25 Arcane Power.", "name": "Aether Walker"}, {"affix": "Chance on killing a demon to gain a random Shrine effect.", "name": "Ahavarion, Spear of Lycander"}, {"affix": "Every successful block has a 21% chance to reduce all cooldowns by 1 second. (Crusader Only) [20 - 25]%", "name": "Akarat's Awakening"}, {"affix": "Akarat's Champion gains the effects of the Prophet and Embodiment of Power runes. (Crusader Only)", "name": "Akkhan's Addendum"}, {"affix": "Each enemy hit by your Blessed Shield increases the damage of your Blessed Shield by 17% for 3 seconds. (Crusader Only) [15 - 20]%", "name": "Akkhan's Leniency"}, {"affix": "Zombie Dogs stuns enemies around them for 1.5 seconds when summoned. (Witch Doctor Only)", "name": "Anessazi Edge"}, {"affix": "Weapon Throw generates up to 17 additional Fury based on how far away the enemy hit is. Maximum benefit when the enemy hit is 20 or more yards away. (Barbarian Only) [15 - 20]", "name": "Arreat's Law"}, {"affix": "Heal for 3% of your missing Life when you kill an Undead enemy. [3 - 4]%", "name": "Arthef's Spark of Life"}, {"affix": "Elemental Arrow gains an effect based on the rune:", "name": "Augustine's Panacea"}, {"affix": "Undead and Demon enemies within 25 yards take 565% weapon damage as Holy every second and are sometimes knocked into the air. [500 - 650]%", "name": "Azurewrath"}, {"affix": "The damage of Tempest Rush is increased by 546% and when your Tempest Rush hits 3 or fewer enemies, it gains 100% Critical Hit Chance. (Monk Only) [450 - 600]%", "name": "Balance"}, {"affix": "Enemies killed while Akarat's Champion is active turn into Phalanx Avatars for 10 seconds. (Crusader Only)", "name": "Baleful Remnant"}, {"affix": "Frenzy now stacks up to 10 times. (Barbarian Only) 10", "name": "Bastion's Revered"}, {"affix": "Two Condemned enemies also trigger Condemn's explosion and the damage of Condemn is increased by 674%. (Crusader Only) [600 - 800]%", "name": "Blade of Prophecy"}, {"affix": "War Cry and Threatening Shout cause an Avalanche and Earthquake. (Barbarian Only)", "name": "Blade of the Tribes"}, {"affix": "Bash consumes up to 40 Fury to deal up to 428% increased damage. (Barbarian Only) [400 - 500]%", "name": "Blade of the Warlord"}, {"affix": "Grants a 17% chance to block attacks. Blocked attacks inflict 30% less damage. After blocking an attack, your next attack inflicts 30% additional damage. [15 - 20]%", "name": "Blood Brother"}, {"affix": "Blood oozes from you.", "name": "Blood-Magic Blade"}, {"affix": "Blood oozes from you.", "name": "Blood-Magic Edge"}, {"affix": "Death Nova deals 94% increased damage for every enemy within 25 yards. (Necromancer Only) [80 - 100]%", "name": "Bloodtide Blade"}, {"affix": "You may have 2 additional Sentries. (Demon Hunter Only)", "name": "Bombardier's Rucksack"}, {"affix": "The damage bonus of Command Skeletons increases by 27% per second they spend attacking the same target. (Necromancer Only) [25 - 30]%", "name": "Bone Ringer"}, {"affix": "Chance on hit to summon a herd of murderous cows.", "name": "Bovine Bardiche"}, {"affix": "Your projectiles pierce 2 additional times. (Demon Hunter Only) [1 - 2]", "name": "Buriza-Do Kyanon"}, {"affix": "Killing enemies and destroying objects has a chance to grant 20% of your maximum primary resource.", "name": "Burst of Wrath"}, {"affix": "The Butcher still inhabits his carver.", "name": "Butcher's Carver"}, {"affix": "Automatically cast Marked for Death when you damage an enemy. (Demon Hunter Only)", "name": "Calamity"}, {"affix": "Falling Sword can be used again within 4 seconds before the cooldown is triggered. (Crusader Only)", "name": "Cam's Rebuttal"}, {"affix": "[25 - 50]% chance to sunder the ground your enemies walk on when you attack.", "name": "Cataclysm"}, {"affix": "Your Spike Traps lure enemies to them. Enemies may be taunted once every 16 seconds. (Demon Hunter Only) [12 - 16]", "name": "Chanon Bolter"}, {"affix": "[25 - 50]% chance to cast a fireball when attacking.", "name": "Cinder Switch"}, {"affix": "45% chance to cluck when attacking. [25 - 50]%", "name": "Cluckeye"}, {"affix": "Chance on kill to raise a skeleton to fight for you. Upon accumulating 5 skeletons, they each explode for 1000% weapon damage and the sword transforms into Ashbringer for a short time. Attacking with Ashbringer burns your enemy for 5462% weapon damage as Holy. [5000 - 6000]%", "name": "Corrupted Ashbringer"}, {"affix": "Teleport gains the effect of the Wormhole rune.", "name": "Cosmic Strand"}, {"affix": "You take 52% less damage from blocked attacks. [45 - 60]%", "name": "Coven's Criterion"}, {"affix": "Dashing Strike reduces your damage taken by 40% for 6 seconds. (Monk Only) [40 - 50]%", "name": "Crystal Fist"}, {"affix": "Fist of the Heavens has a 57% chance to be cast twice. (Crusader Only) [45 - 60]%", "name": "Darklight"}, {"affix": "Reduce the cooldown of Vengeance by 62%. (Demon Hunter Only) [50 - 65]%", "name": "Dawn"}, {"affix": "Multishot hits enemies below 60% health twice and its damage is increased by 150%. (Demon Hunter Only) [150 - 200]%", "name": "Dead Man's Legacy"}, {"affix": "Grasp of the Dead gains the effect of the Rain of Corpses rune. (Witch Doctor Only)", "name": "Deadly Rebirth"}, {"affix": "While channeling Arcane Torrent, Disintegrate, or Ray of Frost, all damage is increased by 294%. (Wizard Only) [250 - 325]%", "name": "Deathwish"}, {"affix": "Blocks have a chance of summoning a charging wolf that deals 927% weapon damage to all enemies it passes through. [800 - 1000]%", "name": "Defender of Westmarch"}, {"affix": "58% chance to shoot explosive bolts when attacking. [35 - 65]%", "name": "Demon Machine"}, {"affix": "Each enemy hit by your Sweep Attack increases the damage of your next Sweep Attack by 109%, stacking up to 5 times. (Crusader Only) [100 - 125]%", "name": "Denial"}, {"affix": "Cleave deals up to 328% increased damage based on percentage of missing Fury. (Barbarian Only) [300 - 400]%", "name": "Dishonored Legacy"}, {"affix": "[20 - 35]% chance to cause the ground to shudder when attacking.", "name": "Earthshatter"}, {"affix": "Reduces the cooldown of Heaven's Fury by 46%. (Crusader Only) [45 - 50]%", "name": "Eberli Charo"}, {"affix": "Bolas now explode instantly.", "name": "Emimei's Duffel"}, {"affix": "Gain 100% Critical Hit Chance against enemies at full health.", "name": "Envious Blade"}, {"affix": "While channeling Arcane Torrent, Disintegrate, or Ray of Frost, the damage of your Arcane Power Spenders is increased by 135% and you also cast one of your other damaging Arcane Power Spenders every second. (Wizard Only) [125 - 150]%", "name": "Etched Sigil"}, {"affix": "Attacking enemies below 17% Life freezes them for 3 seconds. [17 - 20]%", "name": "Eun-jang-do"}, {"affix": "Each enemy hit by Falling Sword increases the damage of Blessed Hammer by 74% for 10 seconds. Max 10 stacks. (Crusader Only) [60 - 80]%", "name": "Faithful Memory"}, {"affix": "Heaven's Fury gains two additional rays and has its damage increased by 473%. (Crusader Only) [375 - 500]%", "name": "Fate of the Fell"}, {"affix": "[25 - 50]% chance to cast a fireball when attacking.", "name": "Fire Brand"}, {"affix": "You are surrounded by a Chilling Aura when attacking.", "name": "Fjord Cutter"}, {"affix": "Your Shield Glare deals damage equal to up to your last 5 Shield Bash casts. (Crusader Only) 5", "name": "Flail of the Ascended"}, {"affix": "Dashing Strike increases the damage of Dashing Strike by 95% for 1 second, stacking up to 5 times. (Monk Only) [75 - 100]%", "name": "Fleshrake"}, {"affix": "Chance to double your attack speed when attacking.", "name": "Flying Dragon"}, {"affix": "Attacks grant you an absorb shield for 2.0% of your maximum Life. Stacks up to 10 times. (Demon Hunter Only) [2.0 - 3.0]%", "name": "Fortress Ballista"}, {"affix": "Spectral Blade attacks 50% faster and deals 179% increased damage. (Wizard Only) [150 - 200]%", "name": "Fragment of Destiny"}, {"affix": "Blocking an attack has a chance to Freeze the attacker for 0.8 seconds. [0.5 - 1.5]", "name": "Freeze of Deflection"}, {"affix": "Condemn has no cooldown and has its damage increased by 727%, but instead costs 40 Wrath. [600 - 800]%", "name": "Frydehr's Wrath"}, {"affix": "Lightning damage has a chance to turn enemies into lightning rods, causing them to pulse 472% weapon damage as Lightning every second to nearby enemies for 6 seconds. [444 - 555]%", "name": "Fulminator"}, {"affix": "Siphon Blood drains blood from 2 additional targets. (Necromancer Only)", "name": "Funerary Pick"}, {"affix": "Reduces the Fury cost of Seismic Slam by 50% and increases its damage by 458%. (Barbarian Only) [400 - 500]%", "name": "Fury of the Vanished Peak"}, {"affix": "Spirit Barrage gains the Phantasm rune. Each active Phantasm increases the damage of Spirit Barrage by 42%. (Witch Doctor Only) [40 - 50]%", "name": "Gazing Demise"}, {"affix": "Chance to summon a ghostly Fallen Champion when attacking.", "name": "Genzaniku"}, {"affix": "Reduces the cooldown of Slow Time by 30%. (Wizard Only) [30 - 40]%", "name": "Gesture of Orpheus"}, {"affix": "Sweep Attack restores 6 Wrath for each enemy hit and has its damage increased by 269%. (Crusader Only) [225 - 300]%", "name": "Golden Flense"}, {"affix": "Smite now jumps to 3 additional enemies.", "name": "Golden Scourge"}, {"affix": "Blessed Hammer damage is increased by 204% for the first 3 enemies it hits. (Crusader Only) [200 - 250]%", "name": "Guard of Johanna"}, {"affix": "Removes the resource cost of Blessed Shield and increases its damage by 319%. (Crusader Only) [275 - 350]%", "name": "Gyrfalcon's Foote"}, {"affix": "95% of your Thorns damage is applied on every attack. [75 - 100]%", "name": "Hack"}, {"affix": "Iron Skin also increases your Block Amount by 52%. (Crusader Only) [45 - 60]%", "name": "Hallowed Bulwark"}, {"affix": "Chance to root enemies to the ground when you hit them.", "name": "Hellrack"}, {"affix": "Gain 10% increased damage while wielding a two-handed weapon. (Crusader Only)", "name": "Hellskull"}, {"affix": "7% chance on hit to summon a Spike Trap, Caltrops or Sentry. (Demon Hunter Only) [7 - 10]%", "name": "Helltrapper"}, {"affix": "The first time an enemy deals damage to you, reduce that damage by 65% and Charm the enemy for 3 seconds. (Witch Doctor Only) [60 - 80]%", "name": "Henri's Perquisition"}, {"affix": "Impale throws two additional knives.", "name": "Holy Point Shot"}, {"affix": "A Zombie Dog is automatically summoned to your side every 2 seconds. (Witch Doctor Only) 2", "name": "Homunculus"}, {"affix": "Your skill cooldowns are reduced by 10 seconds for 15 seconds after killing an elite pack. [8 - 10]", "name": "In-geom"}, {"affix": "Reduces the Spirit cost of Wave of Light by 50% and increases its damage by 478%. (Monk Only) [450 - 550]%", "name": "Incense Torch of the Grand Temple"}, {"affix": "Casting Consecration also casts Consecration beneath all of your allies.", "name": "Inviolable Faith"}, {"affix": "Attacking with Siphon Blood has a 42% chance to cast a free Blood Nova. (Necromancer Only) [40 - 50]%", "name": "Iron Rose"}, {"affix": "Blocks release forward a Fires of Heaven. (Crusader Only)", "name": "Ivory Tower"}, {"affix": "Increase the size of your Blessed Hammers. (Crusader Only)", "name": "Jace's Hammer of Vigilance"}, {"affix": "When Dashing Strike hits an enemy more than 32 yards away, its Charge cost is refunded. (Monk Only) [30 - 35]", "name": "Jawbreaker"}, {"affix": "Blessed Shield ricochets to 6 additional enemies and has its damage increased by 256%. [225 - 300]%", "name": "Jekangbord"}, {"affix": "Increase the attack speed and damage of Blessed Hammer by 100%. (Crusader Only) 100%", "name": "Johanna's Argument"}, {"affix": "Blessed Hammer gains the effect of the Dominion rune. (Crusader Only)", "name": "Justinian's Mercy"}, {"affix": "Strafe gains the effect of the Drifting Shadow rune. (Demon Hunter Only)", "name": "K'mar Tenclip"}, {"affix": "The damage of Impale is increased by 344% and it returns 15 Hatred if it hits an enemy already Impaled. (Demon Hunter Only) [300 - 375]%", "name": "Karlei's Point"}, {"affix": "Casting Justice increases your movement speed by 17% for 2 seconds. (Crusader Only) [15 - 20]%", "name": "Kassar's Retribution"}, {"affix": "Elemental Arrow now generates 3 Hatred. (Demon Hunter Only) [3 - 4]", "name": "Kridershot"}, {"affix": "Increase the damage of Wave of Light by 150%. When the initial impact of your Wave of Light hits 3 or fewer enemies, the damage is increased by 229%. (Monk Only) [200 - 250]%", "name": "Kyoshiro's Blade"}, {"affix": "Reduces cooldown of Mass Confusion by 17 seconds. (Witch Doctor Only) [15 - 20]", "name": "Last Breath"}, {"affix": "Grim Scythe deals an additional 67% damage for each point of essence it restores. (Necromancer Only) [65 - 80]%", "name": "Leger's Disdain"}, {"affix": "Bolas have a 17% chance on explosion to pull in all enemies within 24 yards. (Demon Hunter Only) [15 - 20]%", "name": "Leonine Bow of Hashir"}, {"affix": "Shadow Power also triggers Smoke Screen. (Demon Hunter Only)", "name": "Lianna's Wings"}, {"affix": "Ray of Frost now pierces. (Wizard Only)", "name": "Light of Grace"}, {"affix": "Seven-Sided Strike performs an additional 7 strikes. 7", "name": "Lion's Claw"}, {"affix": "Every second, gain 328% increased damage for your next Fan of Knives. Stacks up to 30 times. (Demon Hunter Only) [300 - 400]%", "name": "Lord Greenstone's Fan"}, {"affix": "Your cold skills reduce the movement speed of enemies by 30%. In addition, your movement speed is increased by 10% for 5 seconds.  Maximum 5 stacks. (Necromancer Only) [8 - 10]%", "name": "Lost Time"}, {"affix": "After killing 10 enemies, you release a Poison Nova that deals 1265% weapon damage as Poison to enemies within 30 yards. [1050 - 1400]%", "name": "Mad Monarch's Scepter"}, {"affix": "Stun enemies for 2 seconds the first time you hit them.", "name": "Madawc's Sorrow"}, {"affix": "Enemies occasionally flee at the sight of this staff.", "name": "Maloth's Focus"}, {"affix": "Bone Spear now costs 40 Essence and deals 646% increased damage. (Necromancer Only) [550 - 700]%", "name": "Maltorius' Petrified Spike"}, {"affix": "Reduces the Hatred cost of Cluster Arrow by 50% and increases its damage by 279%. (Demon Hunter Only) [250 - 300]%", "name": "Manticore"}, {"affix": "Chance on hit to summon a Demonic Slave.", "name": "Maximus"}, {"affix": "Magic Missile fires 1 extra missile. (Wizard Only) [1 - 2]", "name": "Mirrorball"}, {"affix": "Firebomb generates 120 Mana. (Witch Doctor Only) [100 - 125]", "name": "Mordullu's Promise"}, {"affix": "Electrocute can chain to enemies that have already been hit. (Wizard Only)", "name": "Myken's Ball of Hate"}, {"affix": "Each different poison skill you use increases the damage of your poison skills by 95% for 15 seconds. (Necromancer Only) [75 - 100]%", "name": "Nayr's Black Death"}, {"affix": "Your primary skills attack 50% faster and deal 179% increased damage. (Barbarian Only) [150 - 200]%", "name": "Oathkeeper"}, {"affix": "34% chance to Chain Lightning enemies when you hit them. [20 - 40]%", "name": "Odyn Son"}, {"affix": "Enemies snared by your Entangling Shot take 22% increased damage from all sources. (Demon Hunter Only) [20 - 25]%", "name": "Odyssey's End"}, {"affix": "Each time you hit an enemy with Explosive Blast your damage is increased by 10% and your damage reduction is increased by 20% for 6 seconds. This effect can stack up to 4 times. (Wizard Only) [8 - 10]%", "name": "Orb of Infinite Depth"}, {"affix": "Squeal!", "name": "Pig Sticker"}, {"affix": "Reduces the Wrath cost of Shield Bash by [40 - 50]%.", "name": "Piro Marella"}, {"affix": "Elemental Exposure's damage bonus per stack is increased to 10%. (Wizard Only) 10%", "name": "Primordial Soul"}, {"affix": "45% chance to lob an acid blob when attacking. [25 - 50]%", "name": "Pus Spitter"}, {"affix": "Spirit spenders that teleport you while Epiphany is active are also mimicked on a nearby target for free. (Monk Only)", "name": "Rabid Strike"}, {"affix": "Every point of Maximum Essence increases your damage by 0.5% and Bone Spikes generates 2 additional Essence for each enemy hit. (Necromancer Only) [2 - 5]", "name": "Reilena's Shadowhook"}, {"affix": "Hammer of the Ancients has a 27% chance to summon an Ancient for 20 seconds. (Barbarian Only) [25 - 30]%", "name": "Remorseless"}, {"affix": "Plague of Toads now seek out enemies and can explode twice. (Witch Doctor Only)", "name": "Rhen'ho Flayer"}, {"affix": "20% chance on hit to instantly deal 10,000% weapon damage as Cold to enemies that are Frozen. 10,000%", "name": "Rimeheart"}, {"affix": "Soul Harvest now stacks up to 10 times. (Witch Doctor Only)", "name": "Sacred Harvester"}, {"affix": "Blocked attacks heal you and your allies for 23% of the amount blocked. (Crusader Only) [20 - 30]%", "name": "Salvation"}, {"affix": "The damage of Lashing Tail Kick is increased by 546% to the first 7 enemies hit. (Monk Only) [450 - 600]%", "name": "Scarbringer"}, {"affix": "Casting a Lightning skill charges you with Lightning, causing you to deal 842% weapon damage as Lightning every second for 5 seconds to nearby enemies. [650 - 850]%", "name": "Schaefer's Hammer"}, {"affix": "40% chance when attacking to explode with demonic fury for 1800-2000% weapon damage as Fire. [20 - 45]%", "name": "Scourge"}, {"affix": "Reduces the Mana cost of Zombie Charger by 40%. (Witch Doctor Only) [40 - 50]%", "name": "Scrimshaw"}, {"affix": "Your Secondary skills deal 379% additional damage while Bone Armor is active but reduce the remaining duration of Bone Armor by 4 seconds. (Necromancer Only) [350 - 400]%", "name": "Scythe of the Cycle"}, {"affix": "You may have one extra Hydra active at a time. (Wizard Only)", "name": "Serpent's Sparker"}, {"affix": "Slain enemies rest in pieces.", "name": "Sever"}, {"affix": "Elemental skills have a chance to trigger a powerful attack that deals 229% weapon damage:", "name": "Shard of Hate"}, {"affix": "Each time an enemy takes damage from your Heaven's Fury, it increases the damage they take from your Heaven's Fury by 26%. (Crusader Only) [25 - 30]%", "name": "Shield of Fury"}, {"affix": "Spirit Walk lasts until you attack or until an enemy is within 30 yards of you. (Witch Doctor Only)", "name": "Shukrani's Triumph"}, {"affix": "Rapid Fire no longer has a channel cost. (Demon Hunter Only)", "name": "Sin Seekers"}, {"affix": "17% chance to Smite enemies for 600-750% weapon damage as Lightning when you hit them. [15 - 20]%", "name": "Sky Splitter"}, {"affix": "Chance to summon angelic assistance when attacking.", "name": "Skycutter"}, {"affix": "Every 60 seconds, gain a random Law for 60 seconds. (Crusader Only)", "name": "Skywarden"}, {"affix": "This wand finds your death humorous.", "name": "Slorak's Madness"}, {"affix": "Critical Hits have a 3% chance to spawn a health globe. [3 - 4]%", "name": "Solanium"}, {"affix": "When you kill an enemy, it explodes for 546% of your Life per Kill as damage to all enemies within 20 yards. You no longer benefit from your Life per Kill. [450 - 600]%", "name": "Soulsmasher"}, {"affix": "Your Thorns is increased by 12% for every enemy afflicted by one of your curses. (Necromancer Only) [10 - 15]%", "name": "Spear of Jairo"}, {"affix": "Chakram now generates 4 Hatred. (Demon Hunter Only) [3 - 4]", "name": "Spines of Seething Hatred"}, {"affix": "Firebats attacks 100% faster, costs 75% less Mana, and has its damage increased by 145%. (Witch Doctor Only) [125 - 150]%", "name": "Staff of Chiroptera"}, {"affix": "Your melee attacks throw a piercing axe at a nearby enemy, dealing 646% weapon damage as Physical. [550 - 700]%", "name": "Stalgard's Decimator"}, {"affix": "Furious Charge deals increased damage equal to 428% of your bonus movement speed. (Barbarian Only) [400 - 500]%", "name": "Standoff"}, {"affix": "Lightning damage is increased by 12% for every 10 yards you are from the target up to a maximum of 40 yards. (Wizard Only) [10 - 15]%", "name": "Starfire"}, {"affix": "Reduce the cooldown of Fetish Army and Big Bad Voodoo by 1 second each time your fetishes deal damage. (Witch Doctor Only)", "name": "Starmetal Kukri"}, {"affix": "Acid Cloud gains the effect of the Lob Blob Bomb rune. (Witch Doctor Only)", "name": "SuWong Diviner"}, {"affix": "When you block, you have up to a 16% chance to Stun the attacker for 1.5 seconds based on your current Wrath. (Crusader Only) [15 - 20]%", "name": "Sublime Conviction"}, {"affix": "[25 - 50]% chance to sunder the ground your enemies walk on when you attack.", "name": "Sunder"}, {"affix": "Doubles the duration of Steed Charge. (Crusader Only)", "name": "Swiftmount"}, {"affix": "Chakram deals 1.4% increased damage for every point of Hatred you have. (Demon Hunter Only) [1.0 - 1.4]%", "name": "Sword of Ill Will"}, {"affix": "Instead of dealing direct damage, your Spirit Barrage now accumulates on the target. When you stop casting, it explodes dealing 245% of the accumulated damage to all enemies within 15 yards. (Witch Doctor Only) [225 - 250]%", "name": "The Barber"}, {"affix": "Chance to fight through the pain when enemies hit you.", "name": "The Burning Axe of Sankis"}, {"affix": "22% chance to drag enemies to you when attacking. [20 - 25]%", "name": "The Butcher's Sickle"}, {"affix": "Your Poison Darts and your Fetishes' Poison Darts now pierce. (Witch Doctor Only)", "name": "The Dagger of Darts"}, {"affix": "The blast from Spike Trap will damage all enemies again after 1 second.", "name": "The Demon's Demise"}, {"affix": "Shield Glare now hits all enemies around you. (Crusader Only)", "name": "The Final Witness"}, {"affix": "Exploding Palm's on-death explosion damage is increased by 428%. (Monk Only) [400 - 500]%", "name": "The Fist of Az'Turrasq"}, {"affix": "Increase the damage of Seven-Sided Strike by 100% and reduce the cooldown of Seven-Sided Strike by 57%. (Monk Only) [45 - 60]%", "name": "The Flow of Eternity"}, {"affix": "Increases damage against elites by 40%. [40 - 50]%", "name": "The Furnace"}, {"affix": "The damage of Hammer of the Ancients is increased by 674% and it returns 25 Fury if it hits 3 or fewer enemies. (Barbarian Only) [600 - 800]%", "name": "The Gavel of Judgment"}, {"affix": "Chance to summon a Fetish when attacking. (Witch Doctor Only)", "name": "The Gidbinn"}, {"affix": "Reduces the Arcane Power cost of Meteor by 50% and increases its damage by 328%. (Wizard Only) [300 - 400]%", "name": "The Grand Vizier"}, {"affix": "Double the number of Bombardment impacts. (Crusader Only)", "name": "The Mortal Drama"}, {"affix": "Hungering Arrow has 23% additional chance to pierce. (Demon Hunter Only) [20 - 25]%", "name": "The Ninth Cirri Satchel"}, {"affix": "Taking damage has up to a 20% chance to reset the cooldown on Teleport. (Wizard Only) [15 - 20]%", "name": "The Oculus"}, {"affix": "Slap!", "name": "The Paddle"}, {"affix": "A raven flies to your side.", "name": "The Raven's Wing"}, {"affix": "Lesser enemies are now lured to your Meteor impact areas. (Wizard Only)", "name": "The Smoldering Core"}, {"affix": "Corpse Spiders releases a web on impact that Slows enemies by 60%. (Witch Doctor Only) [60 - 80]%", "name": "The Spider Queen's Grasp"}, {"affix": "Increase the damage of Weapon Throw and Ancient Spear by 57%. (Barbarian Only) [45 - 60]%", "name": "The Three Hundredth Spear"}, {"affix": "Chance to charm enemies when you hit them.", "name": "The Tormentor"}, {"affix": "Energy Twister damage is increased by 145% for each Energy Twister you have out up to a maximum of 5. (Wizard Only) [125 - 150]%", "name": "The Twisted Sword"}, {"affix": "Increases Gold and Health Pickup by 20 yards. (Witch Doctor Only) 20", "name": "Thing of the Deep"}, {"affix": "Chance on hit to blast your enemy with Lightning, dealing 355% weapon damage as Lightning and then jumping to additional nearby enemies. Each enemy hit has their attack speed and movement speed reduced by 30% for 3 seconds. Jumps up to 5 targets. [279 - 372]%", "name": "Thunderfury, Blessed Blade of the Windseeker"}, {"affix": "The Cursed Scythe rune for Grim Scythe now has a 100% chance to apply a curse and you deal 179% increased damage to cursed enemies. (Necromancer Only) [150 - 200]%", "name": "Trag'Oul's Corroded Fang"}, {"affix": "Your Signature Spells increase the damage of Arcane Orb by 375% for 6 seconds, stacking up to 3 times. (Wizard Only) [300 - 400]%", "name": "Triumvirate"}, {"affix": "27% of the damage you take is redirected to your Zombie Dogs. (Witch Doctor Only) [25 - 30]%", "name": "Uhkapian Serpent"}, {"affix": "Phalanx now casts twice. (Crusader Only)", "name": "Unrelenting Phalanx"}, {"affix": "The damage of Arcane Orb is increased by 378% and its explosion triggers an additional time. (Wizard Only) [350 - 450]%", "name": "Unstable Scepter"}, {"affix": "Strafe projectiles pierce. (Demon Hunter Only)", "name": "Valla's Bequest"}, {"affix": "Energy Twister now travels in a straight path. (Wizard Only)", "name": "Valthek's Rebuke"}, {"affix": "Increases the maximum stack count of Sweeping Wind by 6. (Monk Only) [6 - 7]", "name": "Vengeful Wind"}, {"affix": "Getting hit has a chance to automatically cast Inner Sanctuary.", "name": "Vigilance"}, {"affix": "Locust Swarm gains the effect of the Pestilence rune and deals 47% increased damage. (Witch Doctor Only) [45 - 60]%", "name": "Vile Hive"}, {"affix": "Enemies affected by Provoke take double damage from Thorns. (Crusader Only)", "name": "Vo'Toyias Spiker"}, {"affix": "Spirit Barrage gains the effects of the Phlebotomize and The Spirit is Willing runes. (Witch Doctor Only)", "name": "Voo's Juicer"}, {"affix": "[20 - 30]% chance to be protected by a shield of bones when you are hit.", "name": "Wall of Bone"}, {"affix": "[20 - 30]% chance to be protected by a shield of bones when you are hit.", "name": "Wall of Man"}, {"affix": "The damage of Explosive Blast is increased by 328% and 3 additional blasts are triggered after casting Explosive Blast. (Wizard Only) [300 - 400]%", "name": "Wand of Woh"}, {"affix": "Tempest Rush gains the effect of the Tailwind rune. (Monk Only)", "name": "Warstaff of General Quang"}, {"affix": "Grasp of the Dead no longer has a cooldown. (Witch Doctor Only)", "name": "Wilken's Reach"}, {"affix": "Enemies killed by Cold damage have a 17% chance to release a Frost Nova. (Wizard Only) [15 - 20]%", "name": "Winter Flurry"}, {"affix": "Performing an attack has a 22% chance to hurl a Frozen Orb. [20 - 25]%", "name": "Wizardspike"}, {"affix": "Rapid Fire deals 72% increased damage for every half second that you channel. Stacks up to 4 times. (Demon Hunter Only) [60 - 75]%", "name": "Wojahnni Assaulter"}, {"affix": "Locust Swarm continuously plagues enemies around you. (Witch Doctor Only)", "name": "Wormwood"}, {"affix": "Multishot attacks 50% faster and its damage is increased by 150%. (Demon Hunter Only) [150 - 200]%", "name": "Yang's Recurve"}]}